<details ><summary>plan for ruby-getting-started-terraform 2025-12-30 11:32:12 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "ruby_getting_started"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + enabled_cloudwatch_logs_exports       = [
          + "error",
          + "general",
          + "slowquery",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.35"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = "ruby-getting-started-mysql-"
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-mysql"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all                              = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-mysql"
          + "Project"     = "ruby-getting-started"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "ruby-getting-started-rds-subnet-group-"
      + subnet_ids              = [
          + "subnet-09ed639138580beae",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-subnet-group"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all                = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-subnet-group"
          + "Project"     = "ruby-getting-started"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_secretsmanager_secret.rds_password will be created
  + resource "aws_secretsmanager_secret" "rds_password" {
      + arn                            = (known after apply)
      + description                    = "RDS master password"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "ruby-getting-started-rds-password-"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-password"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all                       = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-password"
          + "Project"     = "ruby-getting-started"
        }
    }

  # aws_secretsmanager_secret_version.rds_password will be created
  + resource "aws_secretsmanager_secret_version" "rds_password" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow MySQL access from bastion"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-07efc7e12d325e692",
                ]
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "ruby-getting-started-rds-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-sg"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-sg"
          + "Project"     = "ruby-getting-started"
        }
      + vpc_id                 = "vpc-08f9a71b86f4ba586"
    }

  # random_password.rds_password will be created
  + resource "random_password" "rds_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_instance_id     = "i-05d16d4fd51f96cc4"
  + connection_instructions = (known after apply)
  + rds_database_name       = "ruby_getting_started"
  + rds_endpoint            = (known after apply)
  + rds_password_secret_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (ruby-getting-started-terraform)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                     RESOURCE                     |
|--------|--------------------------------------------------|
| add    | `aws_db_instance.main`                           |
|        | `aws_db_subnet_group.main`                       |
|        | `aws_secretsmanager_secret.rds_password`         |
|        | `aws_secretsmanager_secret_version.rds_password` |
|        | `aws_security_group.rds`                         |
|        | `random_password.rds_password`                   |

| CHANGE |          OUTPUT           |
|--------|---------------------------|
| add    | `bastion_instance_id`     |
|        | `connection_instructions` |
|        | `rds_database_name`       |
|        | `rds_endpoint`            |
|        | `rds_password_secret_arn` |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p ruby-getting-started-terraform
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>